// // ## Callbacks

// // 400\. Объявите функцию `foo` со входящим параметром `f`. Функция `foo` должна возвращать результат вызова `f` как функции. 
// Вызовите `foo` со входящим значением равным анонимной функции, которая возвращает `42`. Каков результат выполнения функции `foo`? Почему?


// // 402\. Объявите функцию `foo` со входящим параметром `wow`. Функция `foo` должна возвращать результат вызова `wow` как функции. 
// Вызовите `foo` со входящим значением равным анонимной функции, которая возвращает `42`. Каков результат выполнения функции `foo`? Почему?

// // 404\. Объявите функцию `foo` со входящим параметром `f`. Функция `foo` должна возвращать результат вызова `f` как функции. 
// Объявите функцию `bar`, которая возвращает `42`. Вызовите `foo` со входящим значением равным функции `bar`. Каков результат выполнения функции `foo`? Почему?

// // 406\. Объявите функцию `foo` со входящим параметром `f`. Функция `foo` должна возвращать результат вызова `f` как функции. 
// Объявите функцию `bar`, которая возвращает `42`. Вызовите `foo` со входящим значением равным вызову функции `bar`. Каков результат выполнения функции `foo`? Почему?
